---
kind: other
id: Properties.T:Autodesk.Revit.DB.FabricationRodInfo
source: html/7493b34a-1d64-9902-af8a-6177df8870ee.htm
---
# FabricationRodInfo Properties

Controls whether the hanger's rod's will be automatically hosted by other elements.